Model: "model"
__________________________________________________________________________________________________
 Layer (type)                Output Shape                 Param #   Connected to                  
==================================================================================================
 in_modis (InputLayer)       [(None, None, None, 15)]     0         []                            
                                                                                                  
 enc_conv_0 (Conv2D)         (None, None, None, 256)      4096      ['in_modis[0][0]']            
                                                                                                  
 enc_bn_0 (BatchNormalizati  (None, None, None, 256)      1024      ['enc_conv_0[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_0 (Dropout)          (None, None, None, 256)      0         ['enc_bn_0[0][0]']            
                                                                                                  
 enc_conv_1 (Conv2D)         (None, None, None, 256)      65792     ['enc_do_0[0][0]']            
                                                                                                  
 enc_bn_1 (BatchNormalizati  (None, None, None, 256)      1024      ['enc_conv_1[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_1 (Dropout)          (None, None, None, 256)      0         ['enc_bn_1[0][0]']            
                                                                                                  
 enc_conv_2 (Conv2D)         (None, None, None, 256)      65792     ['enc_do_1[0][0]']            
                                                                                                  
 enc_bn_2 (BatchNormalizati  (None, None, None, 256)      1024      ['enc_conv_2[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_2 (Dropout)          (None, None, None, 256)      0         ['enc_bn_2[0][0]']            
                                                                                                  
 enc_conv_3 (Conv2D)         (None, None, None, 16)       4112      ['enc_do_2[0][0]']            
                                                                                                  
 enc_bn_3 (BatchNormalizati  (None, None, None, 16)       64        ['enc_conv_3[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_3 (Dropout)          (None, None, None, 16)       0         ['enc_bn_3[0][0]']            
                                                                                                  
 enc_out (Conv2D)            (None, None, None, 9)        153       ['enc_do_3[0][0]']            
                                                                                                  
 in_geom (InputLayer)        [(None, None, None, 2)]      0         []                            
                                                                                                  
 concat_geom (Concatenate)   (None, None, None, 11)       0         ['enc_out[0][0]',             
                                                                     'in_geom[0][0]']             
                                                                                                  
 dec_conv_0 (Conv2D)         (None, None, None, 128)      1536      ['concat_geom[0][0]']         
                                                                                                  
 dec_bn_0 (BatchNormalizati  (None, None, None, 128)      512       ['dec_conv_0[0][0]']          
 on)                                                                                              
                                                                                                  
 dec_do_0 (Dropout)          (None, None, None, 128)      0         ['dec_bn_0[0][0]']            
                                                                                                  
 dec_conv_1 (Conv2D)         (None, None, None, 128)      16512     ['dec_do_0[0][0]']            
                                                                                                  
 dec_bn_1 (BatchNormalizati  (None, None, None, 128)      512       ['dec_conv_1[0][0]']          
 on)                                                                                              
                                                                                                  
 dec_do_1 (Dropout)          (None, None, None, 128)      0         ['dec_bn_1[0][0]']            
                                                                                                  
 dec_conv_2 (Conv2D)         (None, None, None, 64)       8256      ['dec_do_1[0][0]']            
                                                                                                  
 dec_bn_2 (BatchNormalizati  (None, None, None, 64)       256       ['dec_conv_2[0][0]']          
 on)                                                                                              
                                                                                                  
 dec_do_2 (Dropout)          (None, None, None, 64)       0         ['dec_bn_2[0][0]']            
                                                                                                  
 dec_conv_3 (Conv2D)         (None, None, None, 32)       2080      ['dec_do_2[0][0]']            
                                                                                                  
 dec_bn_3 (BatchNormalizati  (None, None, None, 32)       128       ['dec_conv_3[0][0]']          
 on)                                                                                              
                                                                                                  
 dec_do_3 (Dropout)          (None, None, None, 32)       0         ['dec_bn_3[0][0]']            
                                                                                                  
 dec_conv_4 (Conv2D)         (None, None, None, 8)        264       ['dec_do_3[0][0]']            
                                                                                                  
 dec_bn_4 (BatchNormalizati  (None, None, None, 8)        32        ['dec_conv_4[0][0]']          
 on)                                                                                              
                                                                                                  
 dec_do_4 (Dropout)          (None, None, None, 8)        0         ['dec_bn_4[0][0]']            
                                                                                                  
 dec_out (Conv2D)            (None, None, None, 2)        18        ['dec_do_4[0][0]']            
                                                                                                  
 in_psf (InputLayer)         [(None, None, None, 1)]      0         []                            
                                                                                                  
 psf (Lambda)                (None, 2)                    0         ['dec_out[0][0]',             
                                                                     'in_psf[0][0]']              
                                                                                                  
==================================================================================================
Total params: 173187 (676.51 KB)
Trainable params: 170899 (667.57 KB)
Non-trainable params: 2288 (8.94 KB)
__________________________________________________________________________________________________
