Model: "model"
__________________________________________________________________________________________________
 Layer (type)                Output Shape                 Param #   Connected to                  
==================================================================================================
 in_modis (InputLayer)       [(None, None, None, 13)]     0         []                            
                                                                                                  
 enc_conv_0 (Conv2D)         (None, None, None, 128)      1792      ['in_modis[0][0]']            
                                                                                                  
 enc_bn_0 (BatchNormalizati  (None, None, None, 128)      512       ['enc_conv_0[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_0 (Dropout)          (None, None, None, 128)      0         ['enc_bn_0[0][0]']            
                                                                                                  
 enc_conv_1 (Conv2D)         (None, None, None, 128)      16512     ['enc_do_0[0][0]']            
                                                                                                  
 enc_bn_1 (BatchNormalizati  (None, None, None, 128)      512       ['enc_conv_1[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_1 (Dropout)          (None, None, None, 128)      0         ['enc_bn_1[0][0]']            
                                                                                                  
 enc_conv_2 (Conv2D)         (None, None, None, 64)       8256      ['enc_do_1[0][0]']            
                                                                                                  
 enc_bn_2 (BatchNormalizati  (None, None, None, 64)       256       ['enc_conv_2[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_2 (Dropout)          (None, None, None, 64)       0         ['enc_bn_2[0][0]']            
                                                                                                  
 enc_conv_3 (Conv2D)         (None, None, None, 64)       4160      ['enc_do_2[0][0]']            
                                                                                                  
 enc_bn_3 (BatchNormalizati  (None, None, None, 64)       256       ['enc_conv_3[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_3 (Dropout)          (None, None, None, 64)       0         ['enc_bn_3[0][0]']            
                                                                                                  
 enc_conv_4 (Conv2D)         (None, None, None, 64)       4160      ['enc_do_3[0][0]']            
                                                                                                  
 enc_bn_4 (BatchNormalizati  (None, None, None, 64)       256       ['enc_conv_4[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_4 (Dropout)          (None, None, None, 64)       0         ['enc_bn_4[0][0]']            
                                                                                                  
 enc_conv_5 (Conv2D)         (None, None, None, 64)       4160      ['enc_do_4[0][0]']            
                                                                                                  
 enc_bn_5 (BatchNormalizati  (None, None, None, 64)       256       ['enc_conv_5[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_5 (Dropout)          (None, None, None, 64)       0         ['enc_bn_5[0][0]']            
                                                                                                  
 enc_conv_6 (Conv2D)         (None, None, None, 64)       4160      ['enc_do_5[0][0]']            
                                                                                                  
 enc_bn_6 (BatchNormalizati  (None, None, None, 64)       256       ['enc_conv_6[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_6 (Dropout)          (None, None, None, 64)       0         ['enc_bn_6[0][0]']            
                                                                                                  
 enc_out (Conv2D)            (None, None, None, 16)       1040      ['enc_do_6[0][0]']            
                                                                                                  
 in_geom (InputLayer)        [(None, None, None, 2)]      0         []                            
                                                                                                  
 concat_geom (Concatenate)   (None, None, None, 18)       0         ['enc_out[0][0]',             
                                                                     'in_geom[0][0]']             
                                                                                                  
 dec_conv_0 (Conv2D)         (None, None, None, 32)       608       ['concat_geom[0][0]']         
                                                                                                  
 dec_bn_0 (BatchNormalizati  (None, None, None, 32)       128       ['dec_conv_0[0][0]']          
 on)                                                                                              
                                                                                                  
 dec_do_0 (Dropout)          (None, None, None, 32)       0         ['dec_bn_0[0][0]']            
                                                                                                  
 dec_conv_1 (Conv2D)         (None, None, None, 8)        264       ['dec_do_0[0][0]']            
                                                                                                  
 dec_bn_1 (BatchNormalizati  (None, None, None, 8)        32        ['dec_conv_1[0][0]']          
 on)                                                                                              
                                                                                                  
 dec_do_1 (Dropout)          (None, None, None, 8)        0         ['dec_bn_1[0][0]']            
                                                                                                  
 dec_out (Conv2D)            (None, None, None, 2)        18        ['dec_do_1[0][0]']            
                                                                                                  
 in_psf (InputLayer)         [(None, None, None, 1)]      0         []                            
                                                                                                  
 psf (Lambda)                (None, 2)                    0         ['dec_out[0][0]',             
                                                                     'in_psf[0][0]']              
                                                                                                  
==================================================================================================
Total params: 47594 (185.91 KB)
Trainable params: 46362 (181.10 KB)
Non-trainable params: 1232 (4.81 KB)
__________________________________________________________________________________________________
