Model: "model"
__________________________________________________________________________________________________
 Layer (type)                Output Shape                 Param #   Connected to                  
==================================================================================================
 in_modis (InputLayer)       [(None, None, None, 16)]     0         []                            
                                                                                                  
 enc_conv_0 (Conv2D)         (None, None, None, 64)       1088      ['in_modis[0][0]']            
                                                                                                  
 enc_bn_0 (BatchNormalizati  (None, None, None, 64)       256       ['enc_conv_0[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_0 (Dropout)          (None, None, None, 64)       0         ['enc_bn_0[0][0]']            
                                                                                                  
 enc_conv_1 (Conv2D)         (None, None, None, 64)       4160      ['enc_do_0[0][0]']            
                                                                                                  
 enc_bn_1 (BatchNormalizati  (None, None, None, 64)       256       ['enc_conv_1[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_1 (Dropout)          (None, None, None, 64)       0         ['enc_bn_1[0][0]']            
                                                                                                  
 enc_conv_2 (Conv2D)         (None, None, None, 32)       2080      ['enc_do_1[0][0]']            
                                                                                                  
 enc_bn_2 (BatchNormalizati  (None, None, None, 32)       128       ['enc_conv_2[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_2 (Dropout)          (None, None, None, 32)       0         ['enc_bn_2[0][0]']            
                                                                                                  
 enc_conv_3 (Conv2D)         (None, None, None, 16)       528       ['enc_do_2[0][0]']            
                                                                                                  
 enc_bn_3 (BatchNormalizati  (None, None, None, 16)       64        ['enc_conv_3[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_3 (Dropout)          (None, None, None, 16)       0         ['enc_bn_3[0][0]']            
                                                                                                  
 enc_out (Conv2D)            (None, None, None, 8)        136       ['enc_do_3[0][0]']            
                                                                                                  
 in_geom (InputLayer)        [(None, None, None, 3)]      0         []                            
                                                                                                  
 concat_geom (Concatenate)   (None, None, None, 11)       0         ['enc_out[0][0]',             
                                                                     'in_geom[0][0]']             
                                                                                                  
 dec_conv_0 (Conv2D)         (None, None, None, 32)       384       ['concat_geom[0][0]']         
                                                                                                  
 dec_bn_0 (BatchNormalizati  (None, None, None, 32)       128       ['dec_conv_0[0][0]']          
 on)                                                                                              
                                                                                                  
 dec_do_0 (Dropout)          (None, None, None, 32)       0         ['dec_bn_0[0][0]']            
                                                                                                  
 dec_conv_1 (Conv2D)         (None, None, None, 32)       1056      ['dec_do_0[0][0]']            
                                                                                                  
 dec_bn_1 (BatchNormalizati  (None, None, None, 32)       128       ['dec_conv_1[0][0]']          
 on)                                                                                              
                                                                                                  
 dec_do_1 (Dropout)          (None, None, None, 32)       0         ['dec_bn_1[0][0]']            
                                                                                                  
 dec_conv_2 (Conv2D)         (None, None, None, 16)       528       ['dec_do_1[0][0]']            
                                                                                                  
 dec_bn_2 (BatchNormalizati  (None, None, None, 16)       64        ['dec_conv_2[0][0]']          
 on)                                                                                              
                                                                                                  
 dec_do_2 (Dropout)          (None, None, None, 16)       0         ['dec_bn_2[0][0]']            
                                                                                                  
 dec_conv_3 (Conv2D)         (None, None, None, 16)       272       ['dec_do_2[0][0]']            
                                                                                                  
 dec_bn_3 (BatchNormalizati  (None, None, None, 16)       64        ['dec_conv_3[0][0]']          
 on)                                                                                              
                                                                                                  
 dec_do_3 (Dropout)          (None, None, None, 16)       0         ['dec_bn_3[0][0]']            
                                                                                                  
 dec_conv_4 (Conv2D)         (None, None, None, 8)        136       ['dec_do_3[0][0]']            
                                                                                                  
 dec_bn_4 (BatchNormalizati  (None, None, None, 8)        32        ['dec_conv_4[0][0]']          
 on)                                                                                              
                                                                                                  
 dec_do_4 (Dropout)          (None, None, None, 8)        0         ['dec_bn_4[0][0]']            
                                                                                                  
 dec_out (Conv2D)            (None, None, None, 2)        18        ['dec_do_4[0][0]']            
                                                                                                  
 in_psf (InputLayer)         [(None, None, None, 1)]      0         []                            
                                                                                                  
 psf (Lambda)                (None, 2)                    0         ['dec_out[0][0]',             
                                                                     'in_psf[0][0]']              
                                                                                                  
==================================================================================================
Total params: 11506 (44.95 KB)
Trainable params: 10946 (42.76 KB)
Non-trainable params: 560 (2.19 KB)
__________________________________________________________________________________________________
