Model: "model_1"
__________________________________________________________________________________________________
 Layer (type)                Output Shape                 Param #   Connected to                  
==================================================================================================
 in_modis (InputLayer)       [(None, None, None, 13)]     0         []                            
                                                                                                  
 enc_conv_0 (Conv2D)         (None, None, None, 256)      3584      ['in_modis[0][0]']            
                                                                                                  
 enc_bn_0 (BatchNormalizati  (None, None, None, 256)      1024      ['enc_conv_0[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_0 (Dropout)          (None, None, None, 256)      0         ['enc_bn_0[0][0]']            
                                                                                                  
 enc_conv_1 (Conv2D)         (None, None, None, 256)      65792     ['enc_do_0[0][0]']            
                                                                                                  
 enc_bn_1 (BatchNormalizati  (None, None, None, 256)      1024      ['enc_conv_1[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_1 (Dropout)          (None, None, None, 256)      0         ['enc_bn_1[0][0]']            
                                                                                                  
 enc_conv_2 (Conv2D)         (None, None, None, 128)      32896     ['enc_do_1[0][0]']            
                                                                                                  
 enc_bn_2 (BatchNormalizati  (None, None, None, 128)      512       ['enc_conv_2[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_2 (Dropout)          (None, None, None, 128)      0         ['enc_bn_2[0][0]']            
                                                                                                  
 enc_conv_3 (Conv2D)         (None, None, None, 128)      16512     ['enc_do_2[0][0]']            
                                                                                                  
 enc_bn_3 (BatchNormalizati  (None, None, None, 128)      512       ['enc_conv_3[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_3 (Dropout)          (None, None, None, 128)      0         ['enc_bn_3[0][0]']            
                                                                                                  
 enc_conv_4 (Conv2D)         (None, None, None, 64)       8256      ['enc_do_3[0][0]']            
                                                                                                  
 enc_bn_4 (BatchNormalizati  (None, None, None, 64)       256       ['enc_conv_4[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_4 (Dropout)          (None, None, None, 64)       0         ['enc_bn_4[0][0]']            
                                                                                                  
 enc_conv_5 (Conv2D)         (None, None, None, 64)       4160      ['enc_do_4[0][0]']            
                                                                                                  
 enc_bn_5 (BatchNormalizati  (None, None, None, 64)       256       ['enc_conv_5[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_5 (Dropout)          (None, None, None, 64)       0         ['enc_bn_5[0][0]']            
                                                                                                  
 enc_conv_6 (Conv2D)         (None, None, None, 64)       4160      ['enc_do_5[0][0]']            
                                                                                                  
 enc_bn_6 (BatchNormalizati  (None, None, None, 64)       256       ['enc_conv_6[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_6 (Dropout)          (None, None, None, 64)       0         ['enc_bn_6[0][0]']            
                                                                                                  
 enc_conv_7 (Conv2D)         (None, None, None, 64)       4160      ['enc_do_6[0][0]']            
                                                                                                  
 enc_bn_7 (BatchNormalizati  (None, None, None, 64)       256       ['enc_conv_7[0][0]']          
 on)                                                                                              
                                                                                                  
 enc_do_7 (Dropout)          (None, None, None, 64)       0         ['enc_bn_7[0][0]']            
                                                                                                  
 enc_out (Conv2D)            (None, None, None, 9)        585       ['enc_do_7[0][0]']            
                                                                                                  
 in_geom (InputLayer)        [(None, None, None, 2)]      0         []                            
                                                                                                  
 model (Functional)          (None, None, None, 2)        3546      ['enc_out[0][0]',             
                                                                     'in_geom[0][0]',             
                                                                     'tf.__operators__.getitem[0][
                                                                    0]',                          
                                                                     'tf.math.reduce_mean[0][0]'] 
|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|
| dec_in_latent (InputLayer  [(None, None, None, 9)]      0         []                           |
| )                                                                                              |
|                                                                                                |
| dec_in_geom (InputLayer)   [(None, None, None, 2)]      0         []                           |
|                                                                                                |
| concat_geom (Concatenate)  (None, None, None, 11)       0         []                           |
|                                                                                                |
| dec_conv_0 (Conv2D)        (None, None, None, 64)       768       []                           |
|                                                                                                |
| dec_bn_0 (BatchNormalizat  (None, None, None, 64)       256       []                           |
| ion)                                                                                           |
|                                                                                                |
| dec_conv_1 (Conv2D)        (None, None, None, 32)       2080      []                           |
|                                                                                                |
| dec_bn_1 (BatchNormalizat  (None, None, None, 32)       128       []                           |
| ion)                                                                                           |
|                                                                                                |
| dec_conv_2 (Conv2D)        (None, None, None, 8)        264       []                           |
|                                                                                                |
| dec_bn_2 (BatchNormalizat  (None, None, None, 8)        32        []                           |
| ion)                                                                                           |
|                                                                                                |
| dec_out (Conv2D)           (None, None, None, 2)        18        []                           |
¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯
 square_reg_layer (SquareRe  (None, None, None, 2)        0         ['model[0][0]']               
 gLayer)                                                                                          
                                                                                                  
 in_psf (InputLayer)         [(None, None, None, 1)]      0         []                            
                                                                                                  
 psf (Lambda)                multiple                     0         ['square_reg_layer[0][0]',    
                                                                     'in_psf[0][0]',              
                                                                     'enc_out[0][0]',             
                                                                     'in_psf[0][0]']              
                                                                                                  
 tf.__operators__.getitem (  (None, 1, 1, 9)              0         ['psf[1][0]']                 
 SlicingOpLambda)                                                                                 
                                                                                                  
 tf.math.reduce_mean (TFOpL  (None, 1, 1, 2)              0         ['in_geom[0][0]']             
 ambda)                                                                                           
                                                                                                  
 tf.__operators__.add (TFOp  (None, 1, None, 2)           0         ['psf[0][0]',                 
 Lambda)                                                             'model[1][0]']               
                                                                                                  
 tf.math.truediv (TFOpLambd  (None, 1, None, 2)           0         ['tf.__operators__.add[0][0]']
 a)                                                                                               
                                                                                                  
==================================================================================================
Total params: 147747 (577.14 KB)
Trainable params: 145491 (568.32 KB)
Non-trainable params: 2256 (8.81 KB)
__________________________________________________________________________________________________
